# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM Schema

In almost all cases, rather than just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins** using shared columns from the two tables. 

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database `'data.sqlite'`.

In [2]:
# Your code here
import pandas as pd
import sqlite3
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston 

Hint: join the employees and offices tables.

In [4]:
# Your code here
cur.execute('''SELECT firstName, lastName
               FROM employees
               JOIN offices
               USING(officeCode)
               WHERE city == 'Boston';''')

df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by.

In [9]:
# Your code here
cur.execute("""SELECT o.officeCode, o.city, COUNT(e.employeeNumber) AS n_employees
               FROM offices AS o 
               LEFT JOIN employees AS e
               USING(officeCode)
               GROUP BY officeCode
               HAVING n_employees = 0;""")

df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

   officeCode    city  n_employees
0          27  Boston            0

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary
# Example: Display the htmlDescription and employee's first and last name for each product that each employee has sold
# What customers live in each city/state?
# What is the average credit rating in each city/state
# How many employees per office

In [11]:
# Your code here
cur.execute("""SELECT customerName, city, state
               FROM customers
               GROUP BY city;""")

df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

                 customerName        city state
0            Warburg Exchange      Aachen
1       Diecast Classics Inc.   Allentown    PA
2            Schuyler Imports   Amsterdam
3             GiftsForHim.com    Auckland
4  Down Under Souveniers, Inc  Auckland

In [24]:
# Your code here
cur.execute("""SELECT avg(creditLimit) AS Avg_Credit, city, state
               FROM customers
               GROUP BY city 
               ORDER BY  Avg_Credit DESC;""")

df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

   Avg_Credit           city state
0    210500.0     San Rafael    CA
1    141300.0         Genève
2    136800.0     Manchester
3    123900.0           Lyon
4    121400.0  Reggio Emilia

In [27]:
# Your code here
cur.execute('''SELECT o.officeCode, o.city, o.state, count(employeeNumber) AS n_employee
               FROM offices AS o
               JOIN employees AS e
               USING(officeCode)
               GROUP BY officeCode
               ORDER BY n_employee DESC;''')

df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df.head()

   officeCode           city       state  n_employee
0           1  San Francisco          CA           6
1           4          Paris                       5
2           6         Sydney                       4
3           7         London                       2
4           5          Tokyo  Chiyoda-Ku           2

## Level Up: Display the names of every individual product that each employee has sold

In [ ]:
# Your code here

## Level Up: Display the Number of Products each employee has sold

In [ ]:
# Your code here

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!